# Запросы, групповые операции

In [2]:
%load_ext sql
%sql mysql://root:adminadmin@localhost:3306/stepik?charset=utf8

In [5]:
%%sql DROP TABLE IF EXISTS `book`;

CREATE TABLE IF NOT EXISTS `book` (
    `book_id` int(10) unsigned NOT NULL AUTO_INCREMENT,
    `title` varchar(50) DEFAULT NULL,
    `author` varchar(30) DEFAULT NULL,
    `price` decimal(8, 2) DEFAULT NULL,
    `amount` int(11) DEFAULT NULL,
    PRIMARY KEY (`book_id`)
) ENGINE = MyISAM AUTO_INCREMENT = 7 DEFAULT CHARSET = utf8;

DELETE FROM
    `book`;

/*!40000 ALTER TABLE `book` DISABLE KEYS */
;

INSERT INTO
    `book` (`book_id`, `title`, `author`, `price`, `amount`)
VALUES
    (
        1,
        'Мастер и Маргарита',
        'Булгаков М.А.',
        670.99,
        3
    ),
    (2, 'Белая гвардия', 'Булгаков М.А.', 540.50, 5),
    (3, 'Идиот', 'Достоевский Ф.М.', 460.00, 10),
    (
        4,
        'Братья Карамазовы',
        'Достоевский Ф.М.',
        799.01,
        3
    ),
    (5, 'Игрок', 'Достоевский Ф.М.', 480.50, 10),
    (
        6,
        'Стихотворения и поэмы',
        'Есенин С.А.',
        650.00,
        15
    );

 * mysql://root:***@localhost:3306/stepik?charset=utf8
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
6 rows affected.

[]

In [6]:
%%sql -- Отобрать различные (уникальные) элементы столбца amount таблицы book.
SELECT
    DISTINCT amount
FROM
    book

 * mysql://root:***@localhost:3306/stepik?charset=utf8
4 rows affected.

[(3,), (5,), (10,), (15,)]

In [7]:
%%sql

SELECT
    DISTINCT author AS Автор,
    COUNT(author) AS Различных_книг,
    SUM(amount) as Количество_экземпляров
FROM
    book
GROUP BY
    author

 * mysql://root:***@localhost:3306/stepik?charset=utf8
3 rows affected.

[('Булгаков М.А.', 2, Decimal('8')),
 ('Достоевский Ф.М.', 3, Decimal('23')),
 ('Есенин С.А.', 1, Decimal('15'))]

In [173]:
%%sql 
-- Вывести фамилию и инициалы автора,
-- минимальную,
-- максимальную и среднюю цену книг каждого автора.Вычисляемые столбцы назвать Минимальная_цена,
-- Максимальная_цена и Средняя_цена соответственно.
SELECT
    DISTINCT author,
    MIN(price) AS Минимальная_цена,
    MAX(price) AS Максимальная_цена,
    AVG(price) AS Средняя_цена
FROM
    book
GROUP BY
    author

   mysql://root:***@localhost:3306/stepik
 * mysql://root:***@localhost:3306/stepik?charset=utf8
3 rows affected.

[('Булгаков М.А.', Decimal('540.50'), Decimal('670.99'), Decimal('605.745000')),
 ('Достоевский Ф.М.', Decimal('460.00'), Decimal('799.01'), Decimal('579.836667')),
 ('Есенин С.А.', Decimal('650.00'), Decimal('650.00'), Decimal('650.000000'))]

In [180]:
%%sql 
-- Для каждого автора вычислить суммарную стоимость книг S (имя столбца Стоимость),
-- а также вычислить налог на добавленную стоимость для полученных сумм (имя столбца НДС),
-- который включен в стоимость и составляет k = 18 %,
-- а также стоимость книг (Стоимость_без_НДС) без него.
-- Значения округлить до двух знаков после запятой.
-- В запросе для расчета НДС(tax) и Стоимости без НДС(S_without_tax) использовать следующие формулы:
SELECT
    DISTINCT author,
    SUM(price * amount) AS Стоимость,
    ROUND(SUM(price * amount * 0.18 / 1.18), 2) AS НДС,
    ROUND(SUM(price * amount / 1.18), 2) AS Стоимость_без_НДС
FROM
    book
GROUP BY
    author

   mysql://root:***@localhost:3306/stepik
 * mysql://root:***@localhost:3306/stepik?charset=utf8
3 rows affected.

[('Булгаков М.А.', Decimal('4715.47'), Decimal('719.31'), Decimal('3996.16')),
 ('Достоевский Ф.М.', Decimal('11802.03'), Decimal('1800.31'), Decimal('10001.72')),
 ('Есенин С.А.', Decimal('9750.00'), Decimal('1487.29'), Decimal('8262.71'))]

In [182]:
%%sql 
-- Вывести цену самой дешевой книги,
-- цену самой дорогой и среднюю цену уникальных книг на складе.
-- Названия столбцов Минимальная_цена,
-- Максимальная_цена,
-- Средняя_цена соответственно.
-- Среднюю цену округлить до двух знаков после запятой.

-- Пояснение.В задании нужно посчитать среднюю цену уникальных книг на складе,
-- а не среднюю цену всех экземпляров книг.
SELECT
    MIN(price) AS Минимальная_цена,
    MAX(price) AS Максимальная_цена,
    ROUND(AVG(price), 2) AS Средняя_цена
FROM
    book

   mysql://root:***@localhost:3306/stepik
 * mysql://root:***@localhost:3306/stepik?charset=utf8
1 rows affected.

[(Decimal('460.00'), Decimal('799.01'), Decimal('600.17'))]

In [184]:
%%sql 
-- Вычислить среднюю цену и суммарную стоимость тех книг,
-- количество экземпляров которых принадлежит интервалу от 5 до 14,
-- включительно.
-- Столбцы назвать Средняя_цена и Стоимость,
-- значения округлить до 2 - х знаков после запятой.
SELECT
    ROUND(AVG(price), 2) AS Средняя_цена,
    SUM(price * amount) AS Стоимость
FROM
    book
WHERE
    amount BETWEEN 5 AND 14

   mysql://root:***@localhost:3306/stepik
 * mysql://root:***@localhost:3306/stepik?charset=utf8
1 rows affected.

[(Decimal('493.67'), Decimal('12107.50'))]

In [8]:
%%sql 
-- Посчитать стоимость всех экземпляров каждого автора 
-- без учета книг « Идиот » и « Белая гвардия ».
-- В результат включить только тех авторов,
-- у которых суммарная стоимость книг 
-- (без учета книг « Идиот » и « Белая гвардия ») 
-- более 5000 руб.
-- Вычисляемый столбец назвать Стоимость.
-- Результат отсортировать по убыванию стоимости.
SELECT
    author,
    SUM(price * amount) AS Стоимость
FROM
    book
WHERE
    title NOT IN ('Идиот', 'Белая гвардия')
GROUP BY
    author
HAVING
    Стоимость > 5000
ORDER BY
    Стоимость DESC

 * mysql://root:***@localhost:3306/stepik?charset=utf8
2 rows affected.

[('Есенин С.А.', Decimal('9750.00')), ('Достоевский Ф.М.', Decimal('7202.03'))]